{
    "sun": {
        "description": "Our star! It is the biggest object in our entire Solar System."
    },
    "asteroid": {
        "description": "The asteroid belt that separates our inner planets from the outer planets."
    },
    "planets": [
        { 
            "name": "Mercury",
            "description": "Mercury is the smallest planet in the Solar System and the closest to the Sun. Its orbit around the Sun takes 87.97 Earth days, the shortest of all the Sun's planets.",
            "id": 1,
            "basicDetails": [{
                "mass": "3.3011 x 10^23 kg (0.055 Earths)", 
                "volume": "6.083 x 10^10 km^3 (0.056 Earths)",
                "surfaceArea": "7.48 x 10^7 km^2 (0.147 Earths)",
                "moonCount": 0
                }]
        }, {
            "name": "Venus",
            "description": "Venus is the second planet from the Sun and is named after the Roman goddess of love and beauty. As the brightest natural object in Earth's night sky after the Moon, Venus can cast shadows and can be visible to the naked eye in broad daylight.",
            "id": 2,
            "basicDetails": [{
                "mass": "4.8675 x 10^24 kg (0.815 Earths)", 
                "volume": "9.2843 x 10^11 km^3 (0.857 Earths)",
                "surfaceArea": "4.6023 x 10^8 km^2 (0.902 Earths)",
                "moonCount": 0
                }]
        }, {
            "name": "Earth",
            "description": "Earth is the third planet from the Sun and the only astronomical object known to harbor life. While large amounts of water can be found throughout the Solar System, only Earth sustains liquid surface water. About 71% of Earth's surface is made up of the ocean, dwarfing Earth's polar ice, lakes, and rivers.",
            "id": 3,
            "basicDetails": [{
                "mass": "5.97237 x 10^24 kg", 
                "volume": "1.08321 x 10^12 km3",
                "surfaceArea": "510 072 000 km^2",
                "moonCount": 1
                }]
        }, {
            "name": "Mars",
            "description": "Mars is the fourth planet from the Sun and the second-smallest planet in the Solar System, being larger than only Mercury. In English, Mars carries the name of the Roman god of war and is often called the 'Red Planet'.",
            "id": 4,
            "basicDetails": [{
                "mass": "6.4171 x 10^23 kg (0.107 Earths)", 
                "volume": "1.63118 x 10^11 km^3 (0.151 Earths)",
                "surfaceArea": "144.37 x 10^8 km^2 (0.284 Earths)",
                "moonCount": 2
                }]
        }, {
            "name": "Jupiter",
            "description": "Jupiter is the fifth planet from the Sun and the largest in the Solar System. It is a gas giant with a mass more than two and a half times that of all the other planets in the Solar System combined, but slightly less than one-thousandth the mass of the Sun.",
            "id": 5,
            "basicDetails": [{
                "mass": "1.8982 x 10^27 kg (317.8 Earths)", 
                "volume": "1.4313 x 10^15 km^3 (1,321 Earths)",
                "surfaceArea": "6.1469 x 10^10 km^2 (120.4 Earths)",
                "moonCount": "80 (57 confirmed, 23 provisional)",
                "moons": []
                }]
        }, {
            "name": "Saturn",
            "description": "Saturn is the sixth planet from the Sun and the second-largest in the Solar System, after Jupiter. It is a gas giant with an average radius of about nine and a half times that of Earth. It has only one-eighth the average density of Earth; however, with its larger volume, Saturn is over 95 times more massive.",
            "id": 6,
            "basicDetails": [{
                "mass": "5.6834 x 10^26 kg (95.159 Earths)", 
                "volume": "8.2713 x 10^14 km^3 (763.59 Earths)",
                "surfaceArea": "4.27 x 10^10 km^2 (83.703 Earths)",
                "moonCount": "83 (63 confirmed, 20 provisional)"
                }]
        }, {
            "name": "Uranus",
            "description": "Uranus is the seventh planet from the Sun. Its name is a reference to the Greek god of the sky, Uranus, who, according to Greek mythology, was the great-grandfather of Ares, grandfather of Zeus and father of Cronus. It has the third-largest planetary radius and fourth-largest planetary mass in the Solar System.",
            "id": 7,
            "basicDetails": [{
                "mass": "(8.6810±0.0013) x 10^25 kg (14.536 Earths)", 
                "volume": "6.833 x 10^13 km^3 (63.086 Earths)",
                "surfaceArea": "4.6023 x 10^8 km^2 (0.902 Earths)",
                "moonCount": 27
                }]
        }, {
            "name": "Neptune",
            "description": "Neptune is the eighth and farthest-known Solar planet from the Sun. In the Solar System, it is the fourth-largest planet by diameter, the third-most-massive planet, and the densest giant planet. It is 17 times the mass of Earth, and slightly more massive than its near-twin Uranus.",
            "id": 8,
            "basicDetails": [{
                "mass": "1.02413 x 1026 kg", 
                "volume": "6.253 x 1013 km^3",
                "surfaceArea": "4.6023 x 10^8 km^2 (0.902 Earths)",
                "moonCount": 14
                }]
        }
    ]
}